#ifndef ITEM_ICONS_H
#define ITEM_ICONS_H
#include "enums.h"
#include "fp.h"

typedef enum {
    ICON_ARROW_LEFT = 0X0,
    ICON_ARROW_RIGHT = 0X28,
    ICON_HAND_POINTER = 0X50,
    ICON_ANIMATED_HANDPOINTER = 0X78,
    ICON_FILLED_CIRCLE = 0XC0,
    ICON_EMPTY_CIRCLE = 0XE8,
    ICON_STATUS_SP_SHINE = 0X23C,
    ICON_STATUS_STAR_PIECE = 0X260,
    ICON_ASLEEP_LOOP = 0X2B8,
    ICON_ASLEEP_BEGIN = 0X314,
    ICON_ASLEEP_END = 0X4B4,
    ICON_ELECTRIFIED_LOOP = 0X60C,
    ICON_ELECTRIFIED_BEGIN = 0X6F8,
    ICON_ELECTRIFIED_END = 0X928,
    ICON_PARALYZED_LOOP = 0XA80,
    ICON_PARALYZED_BEGIN = 0XB6C,
    ICON_PARALYZED_END = 0XD9C,
    ICON_DIZZY_LOOP = 0XEF4,
    ICON_DIZZY_BEGIN = 0XF50,
    ICON_DIZZY_END = 0X10F0,
    ICON_POISONED_LOOP = 0X1248,
    ICON_POISONED_BEGIN = 0X12A4,
    ICON_POISONED_END = 0X1444,
    ICON_FROZEN_LOOP = 0X159C,
    ICON_FROZEN_BEGIN = 0X15F8,
    ICON_FROZEN_END = 0X1798,
    ICON_WEAKENED_LOOP = 0X18F0,
    ICON_WEAKENED_BEGIN = 0X192C,
    ICON_WEAKENED_END = 0X1AAC,
    ICON_STOPPED_BEGIN = 0X1C60,
    ICON_STOPPED_END = 0X1E00,
    ICON_SHRUNK_LOOP = 0X1F58,
    ICON_SHRUNK_BEGIN = 0X1FB4,
    ICON_SHRUNK_END = 0X2154,
    ICON_TRANSPARENT_LOOP = 0X22AC,
    ICON_TRANSPARENT_BEGIN = 0X2328,
    ICON_TRANSPARENT_END = 0X24E8,
    ICON_BOOST_JUMP_LOOP = 0X2640,
    ICON_BOOST_JUMP_BEGIN = 0X266C,
    ICON_BOOST_JUMP_END = 0X27CC,
    ICON_BOOST_HAMMER_LOOP = 0X2938,
    ICON_BOOST_HAMMER_BEGIN = 0X2964,
    ICON_BOOST_HAMMER_END = 0X2AC4,
    ICON_BOOST_PARTNER = 0X2C30,
    ICON_SURPRISE = 0X2C5C,
    ICON_FP_COST = 0X2C88,
    ICON_FP_COST_REDUCED = 0X2CB4,
    ICON_FP_COST_REDUCED_TWICE = 0X2CE0,
    ICON_NOT_ENOUGH_FP = 0X2D0C,
    ICON_POW_COST = 0X2D38,
    ICON_POW_COST_REDUCED = 0X2D64,
    ICON_POW_COST_REDUCED_TWICE = 0X2D90,
    ICON_NOT_ENOUGH_POW = 0X2DBC,
    ICON_GREEN_ARROW_DOWN = 0X2DE8,
    ICON_GREEN_ARROW_UP = 0X2E34,
    ICON_UNUSED_PINK_FRAME = 0X2E80,
    ICON_UNUSED_DIGIT_1 = 0X2EAC,
    ICON_UNUSED_DIGIT_2 = 0X2ED8,
    ICON_UNUSED_DIGIT_3 = 0X2F04,
    ICON_RED_BAR_1 = 0X2F30,
    ICON_EMPTY_BAR = 0X2F5C,
    ICON_RED_BAR_2 = 0X2F88,
    ICON_MARIO_HEAD = 0X2FB4,
    ICON_ELDSTAR = 0X2FE0,
    ICON_ELDSTAR_DISABLED = 0X300C,
    ICON_MAMAR = 0X3038,
    ICON_MAMAR_DISABLED = 0X3064,
    ICON_SKOLAR = 0X3090,
    ICON_SKOLAR_DISABLED = 0X30BC,
    ICON_MUSKULAR = 0X30E8,
    ICON_MUSKULAR_DISABLED = 0X3114,
    ICON_MISSTAR = 0X3140,
    ICON_MISSTAR_DISABLED = 0X316C,
    ICON_KLEVAR = 0X3198,
    ICON_KLEVAR_DISABLED = 0X31C4,
    ICON_KALMAR = 0X31F0,
    ICON_KALMAR_DISABLED = 0X321C,
    ICON_STAR_BEAM = 0X3248,
    ICON_STAR_BEAM_DISABLED = 0X3274,
    ICON_PEACH_BEAM = 0X32A0,
    ICON_PEACH_BEAM_DISABLED = 0X32CC,
    ICON_PARTNER_0 = 0X32F8,
    ICON_PARTNER_0_DISABLED = 0X3320,
    ICON_GOOMBARIO = 0X3348,
    ICON_GOOMBARIO_DISABLED = 0X3370,
    ICON_KOOPER = 0X3398,
    ICON_KOOPER_DISABLED = 0X33C0,
    ICON_BOMBETTE = 0X33E8,
    ICON_BOMBETTE_DISABLED = 0X3410,
    ICON_PARAKARRY = 0X3438,
    ICON_PARAKARRY_DISABLED = 0X3460,
    ICON_BOW = 0X3488,
    ICON_BOW_DISABLED = 0X34B0,
    ICON_WATT = 0X34D8,
    ICON_WATT_DISABLED = 0X3500,
    ICON_SUSHIE = 0X3528,
    ICON_SUSHIE_DISABLED = 0X3550,
    ICON_LAKILESTER = 0X3578,
    ICON_LAKILESTER_DISABLED = 0X35A0,
    ICON_PARTNER_9 = 0X35C8,
    ICON_PARTNER_9_DISABLED = 0X35F0,
    ICON_PARTNER_A = 0X3618,
    ICON_PARTNER_A_DISABLED = 0X3640,
    ICON_PARTNER_B = 0X3668,
    ICON_PARTNER_B_DISABLED = 0X3690,
    ICON_STATUS_TIMES = 0X36B8,
    ICON_STATUS_SLASH = 0X36E0,
    ICON_STATUS_DIGIT_0 = 0X3708,
    ICON_STATUS_DIGIT_1 = 0X3730,
    ICON_STATUS_DIGIT_2 = 0X3758,
    ICON_STATUS_DIGIT_3 = 0X3780,
    ICON_STATUS_DIGIT_4 = 0X37A8,
    ICON_STATUS_DIGIT_5 = 0X37D0,
    ICON_STATUS_DIGIT_6 = 0X37F8,
    ICON_STATUS_DIGIT_7 = 0X3820,
    ICON_STATUS_DIGIT_8 = 0X3848,
    ICON_STATUS_DIGIT_9 = 0X3870,
    ICON_STATUS_HP = 0X3898,
    ICON_STATUS_FP = 0X38C0,
    ICON_STATUS_SP_INCREMENT_1 = 0X38E8,
    ICON_STATUS_SP_INCREMENT_2 = 0X3910,
    ICON_STATUS_SP_INCREMENT_3 = 0X3938,
    ICON_STATUS_SP_INCREMENT_4 = 0X3960,
    ICON_STATUS_SP_INCREMENT_5 = 0X3988,
    ICON_STATUS_SP_INCREMENT_6 = 0X39B0,
    ICON_STATUS_SP_INCREMENT_7 = 0X39D8,
    ICON_STATUS_SP_EMPTY_INCREMENT = 0X3A00,
    ICON_STATUS_STAR_1 = 0X3A28,
    ICON_STATUS_STAR_2 = 0X3A50,
    ICON_STATUS_STAR_3 = 0X3A78,
    ICON_STATUS_STAR_4 = 0X3AA0,
    ICON_STATUS_STAR_5 = 0X3AC8,
    ICON_STATUS_STAR_6 = 0X3AF0,
    ICON_STATUS_STAR_7 = 0X3B18,
    ICON_STATUS_STAR_EMPTY = 0X3B40,
    ICON_STATUS_HEART = 0X3B68,
    ICON_STATUS_FLOWER = 0X3B88,
    ICON_STATUS_COIN = 0X3BA8,
    ICON_STATUS_STAR_POINT = 0X3CFC,
    ICON_MENU_BOOTS_1 = 0X3D94,
    ICON_MENU_BOOTS_1_DISABLED = 0X3DBC,
    ICON_MENU_BOOTS_2 = 0X3DE4,
    ICON_MENU_BOOTS_2_DISABLED = 0X3E0C,
    ICON_MENU_BOOTS_3 = 0X3E34,
    ICON_MENU_BOOTS_3_DISABLED = 0X3E5C,
    ICON_MENU_HAMMER_1 = 0X3E84,
    ICON_MENU_HAMMER_1_DISABLED = 0X3EAC,
    ICON_MENU_HAMMER_2 = 0X3ED4,
    ICON_MENU_HAMMER_2_DISABLED = 0X3EFC,
    ICON_MENU_HAMMER_3 = 0X3F24,
    ICON_MENU_HAMMER_3_DISABLED = 0X3F4C,
    ICON_MENU_ITEM = 0X3F74,
    ICON_MENU_ITEM_DISABLED = 0X3F9C,
    ICON_MENU_STAR_POWER = 0X3FC4,
    ICON_MENU_STAR_POWER_DISABLED = 0X3FEC,
    ICON_PERIL = 0X4014,
    ICON_DANGER = 0X4064,
    ICON_REFUND = 0X40B4,
    ICON_HAPPY = 0X40FC,
    ICON_HP_DRAIN = 0X4124,
    ICON_BLUE_METER = 0X414C,
    ICON_A_BUTTON = 0X4178,
    ICON_A_BUTTON_DOWN = 0X41A4,
    ICON_MASH_A_BUTTON = 0X41D0,
    ICON_PRESS_A_BUTTON = 0X420C,
    ICON_SLOWLY_PRESS_A_BUTTON = 0X4248,
    ICON_SLOWLY_MASH_A_BUTTON = 0X4284,
    ICON_START_BUTTON = 0X42C0,
    ICON_START_BUTTON_DOWN = 0X42EC,
    ICON_MASH_START_BUTTON = 0X4318,
    ICON_PRESS_START_BUTTON = 0X4354,
    ICON_START_BUTTON_TEXT = 0X4390,
    ICON_ROTATE_STICK_CW = 0X43BC,
    ICON_STICK_NEUTRAL = 0X446C,
    ICON_STICK_HOLD_LEFT = 0X4498,
    ICON_STICK_BACK_AND_FORTH = 0X44D0,
    ICON_STICK_MASH_LEFT = 0X4580,
    ICON_STICK_TAP_LEFT = 0X45E0,
    ICON_STICK_TAP_NEUTRAL = 0X4640,
    ICON_STICK_HOLD_DOWN = 0X46DC,
    ICON_STICK_MASH_DOWN = 0X4714,
    ICON_STICK_TAP_DOWN = 0X4774,
    ICON_STICK_SLOWLY_TAP_DOWN = 0X47D4,
    ICON_STICK_TAP_RIGHT = 0X4834,
    ICON_RUN_AWAY_OK = 0X4894,
    ICON_MENU_TIMES = 0X48C0,
    ICON_PARTNER_RANK_1_A = 0X48E8,
    ICON_PARTNER_RANK_1_B = 0X4910,
    ICON_PARTNER_RANK_2_A = 0X4938,
    ICON_PARTNER_RANK_2_B = 0X4960,
    ICON_MOVE_DIAMOND = 0X4988,
    ICON_MOVE_BLUE_ORB = 0X49B0,
    ICON_MOVE_GREEN_ORB = 0X49D8,
    ICON_MOVE_RED_ORB = 0X4A00,
    ICON_MOVE_DIAMOND_DISABLED = 0X4A28,
    ICON_MOVE_BLUE_ORB_DISABLED = 0X4A50,
    ICON_MOVE_GREEN_ORB_DISABLED = 0X4A78,
    ICON_MOVE_RED_ORB_DISABLED = 0X4AA0
} icon_global;

typedef struct {
    /* 0x00 */ s32 fold_idx;
    /* 0x04 */ Vec3f position;
    /* 0x10 */ Vec3f rotation;
    /* 0x1C */ Vec3f scale;
    /* 0x28 */ Vec2s pivot;
    /* 0x30 */ VtxRect unk_30[3];
} game_icon_transform; // size = 0xF0

typedef struct {
    /* 0x00 */ u32 flags;
    /* 0x04 */ HudScript *read_pos;
    /* 0x08 */ HudScript *anim;
    /* 0x0C */ HudScript *loop_start_pos;
    /* 0x10 */ u8 *raster_addr;
    /* 0x14 */ u8 *palette_addr;
    /* 0x18 */ s32 mem_offset;
    /* 0x1C */ game_icon_transform *transform;
    /* 0x20 */ f32 delta_size_x;
    /* 0x24 */ f32 delta_size_y;
    /* 0x28 */ f32 unk_img_scale[2];
    /* 0x30 */ f32 uniform_scale;
    /* 0x34 */ s32 width_scale;  ///< X10
    /* 0x38 */ s32 height_scale; ///< X10
    /* 0x3C */ s16 render_pos_x;
    /* 0x3E */ s16 render_pos_y;
    /* 0x40 */ Vec2b screen_pos_offset;
    /* 0x42 */ Vec3b world_pos_offset;
    /* 0x45 */ s8 draw_size_preset;
    /* 0x46 */ s8 tile_size_preset;
    /* 0x47 */ s8 update_timer;
    /* 0x48 */ u8 size_x; /* screen size? */
    /* 0x49 */ u8 size_y; /* screen size? */
    /* 0x4A */ u8 alpha;
    /* 0x4B */ Color_RGB8 tint;
    /* 0x4E */ Vec2bu custom_image_size;
    /* 0x50 */ Vec2bu custom_draw_size;
} game_icon; // size = 0x54

game_icon *game_icons_create_global(icon_global icon, s32 x, s32 y, u8 alpha,
                                    f32 scale); /// note that not every icon works yet
game_icon *game_icons_create_item(Item item, s32 x, s32 y, u8 alpha, f32 scale, _Bool grayscale);
game_icon *game_icons_create_partner(Partner partner, s32 x, s32 y, u8 alpha, f32 scale, _Bool grayscale);

void game_icons_set_render_pos(game_icon *icon, s32 x, s32 y);
void game_icons_set_scale(game_icon *icon, f32 scale);
void game_icons_set_alpha(game_icon *icon, s32 alpha);
void game_icons_set_tint(game_icon *icon, u8 r, u8 g, u8 b);

void game_icons_draw(game_icon *icon);
void game_icons_delete(game_icon *icon);

game_icon *game_icons_update_next();

#endif
